# Database Management Systems - Lab 3
## Sreehari P Sreedhar
CB.SC.I5DAS20032

In [1]:
import os

try:
    os.remove('./Dumps/lab3.db')
except FileNotFoundError:
    pass

In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect('./Dumps/lab3.db')

cur = conn.cursor()

In [4]:
createTables = '''
    BEGIN;

    CREATE TABLE IF NOT EXISTS BUYER (
        CLIENT_ID VARCHAR(15) PRIMARY KEY,
        NAME VARCHAR(20),
        ADDRESS1 VARCHAR(30),
        ADDRESS2 VARCHAR(30),
        CITY VARCHAR(15),
        STATE VARCHAR(15),
        PINCODE INT(6),
        BALANCE INT(10, 2)
    );

    CREATE TABLE IF NOT EXISTS SELLER (
        PRODUCT_ID VARCHAR(15) PRIMARY KEY,
        PROD_NAME VARCHAR(20),
        PROFIT_PERCENT INT(5),
        STOCK INT(5),
        MINIMUM_STOCK INT(5),
        SELL_PRICE INT(10, 2),
        COST_PRICE INT(10, 2)
    );

    COMMIT;
'''

cur.executescript(createTables)

In [5]:
dataBuyer = [
    ('C-1003', 'XAVIER', 'EINSTEIN STREET', 'LANE 3', 'CHENNAI', 'TAMIL NADU', 642005, 2000.25),
    ('C-1005', 'BASHEEM', 'MAHATMA STREET', 'LANE 2', 'MUMBAI', 'MAHARASTRA', 641105, 650.75),
    ('C-1002', 'RAJU', 'ARMSTRONG STREET', 'LANE 2', 'MUMBAI', 'MAHARASTRA', 641105, 0),
    ('C-1001', 'ANAND', 'RAJA STREET', 'LANE 1', 'COIMBATORE', 'TAMIL NADU', 641005, 15000.2),
    ('C-1004', 'PAANDU', 'COLUMBUS STREET', 'LANE 1', 'COIMBATORE', 'TAMIL NADU', 641005, 1500.45),
    ('C-1006', 'FLASHMA', 'INDIRA STREET', 'LANE 3', 'KOLKATA', 'WESTBENGAL', 641005, 100.23),
]

cur.executemany('INSERT INTO BUYER VALUES (?, ?, ?, ?, ?, ?, ?, ?)', dataBuyer)

In [6]:
dataSeller = [
    ('P-2564',	'LG MONITOR',	5,	100,	20,	52500,	50000),
    ('P-3598',	'SAM MONITOR',	6,	10,	3,	11872,	11200),
    ('P-5864',	'HP MONITOR',	5,	20,	5,	7875,	7500),
    ('P-6594',	'ACER MONITOR',	5,	20,	100,	23100,	22000),
    ('P-2484',	'DELL MONITOR',	2,	10,	3,	30600,	30000),
    ('P-4569',	'LENO MONITOR',	2.5,	10,	3,	53043.75,	51750),
    ('P-1846',	'APPL MONITOR',	4,	10,	3,	39520,	38000),
    ('P-7596',	'COMPAQ MONITOR',	5,	10,	3,	7875,	7500),
    ('P-3265',	'XIAOMI MONITOR',	5,	2,	3,	7875,	7500)
]

cur.executemany('INSERT INTO SELLER VALUES (?, ?, ?, ?, ?, ?, ?)', dataSeller)

In [7]:
conn.commit()

# Questions:

1.Find all the products whose sell price is greater than 50000

In [8]:
cur.execute('SELECT * FROM SELLER WHERE SELL_PRICE > 50000').fetchall()

[('P-2564', 'LG MONITOR', 5, 100, 20, 52500, 50000),
 ('P-4569', 'LENO MONITOR', 2.5, 10, 3, 53043.75, 51750)]

2.Find the product whose selling price is greater than 20000 and less than or equal to 50000

In [9]:
cur.execute('SELECT * FROM SELLER WHERE SELL_PRICE > 20000 AND SELL_PRICE <= 50000').fetchall()

[('P-6594', 'ACER MONITOR', 5, 20, 100, 23100, 22000),
 ('P-2484', 'DELL MONITOR', 2, 10, 3, 30600, 30000),
 ('P-1846', 'APPL MONITOR', 4, 10, 3, 39520, 38000)]

3.List the name, city and state of clients not in the state of ‘MAHARASTRA.

In [10]:
cur.execute('SELECT NAME, CITY, STATE FROM BUYER WHERE STATE != "MAHARASTRA"').fetchall()

[('XAVIER', 'CHENNAI', 'TAMIL NADU'),
 ('ANAND', 'COIMBATORE', 'TAMIL NADU'),
 ('PAANDU', 'COIMBATORE', 'TAMIL NADU'),
 ('FLASHMA', 'KOLKATA', 'WESTBENGAL')]

4.Change the costprice of ‘LG MONITOR to Rs.55000

In [11]:
cur.execute('UPDATE SELLER SET COST_PRICE = 55000 WHERE PROD_NAME = "LG MONITOR"').fetchall()

[]

5.Delete the record with client C-1001 from the buyertable.

In [12]:
cur.execute('DELETE FROM BUYER WHERE CLIENT_ID = "C-1001"').fetchall()

[]

6.Change the city of client_id’C-1005’ to some other city.

In [13]:
cur.execute('UPDATE BUYER SET CITY = "PUNE" WHERE CLIENT_ID = "C-1005"').fetchall()

[]

7.Change the balanceof client_id‘C1002, to 1000.

In [14]:
cur.execute('UPDATE BUYER SET BALANCE = 1000 WHERE CLIENT_ID = "C-1002"').fetchall()

[]

8.Find the products whose selling price is more than 15000 and also set the new selling price as original selling price *5%.

In [15]:
cur.execute('SELECT * FROM SELLER WHERE SELL_PRICE > 15000').fetchall()

[('P-2564', 'LG MONITOR', 5, 100, 20, 52500, 55000),
 ('P-6594', 'ACER MONITOR', 5, 20, 100, 23100, 22000),
 ('P-2484', 'DELL MONITOR', 2, 10, 3, 30600, 30000),
 ('P-4569', 'LENO MONITOR', 2.5, 10, 3, 53043.75, 51750),
 ('P-1846', 'APPL MONITOR', 4, 10, 3, 39520, 38000)]

In [16]:
cur.execute('UPDATE SELLER SET SELL_PRICE = SELL_PRICE*1.05 WHERE  SELL_PRICE > 15000').fetchall()

[]

In [17]:
cur.execute('SELECT * FROM SELLER WHERE SELL_PRICE > 15000').fetchall()

[('P-2564', 'LG MONITOR', 5, 100, 20, 55125, 55000),
 ('P-6594', 'ACER MONITOR', 5, 20, 100, 24255, 22000),
 ('P-2484', 'DELL MONITOR', 2, 10, 3, 32130, 30000),
 ('P-4569', 'LENO MONITOR', 2.5, 10, 3, 55695.9375, 51750),
 ('P-1846', 'APPL MONITOR', 4, 10, 3, 41496, 38000)]

9.Find out the clients who stay in a city whose second letter is ‘O’.

In [18]:
cur.execute('SELECT * FROM BUYER WHERE CITY LIKE "_O%"').fetchall()

[('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'LANE 1',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45),
 ('C-1006',
  'FLASHMA',
  'INDIRA STREET',
  'LANE 3',
  'KOLKATA',
  'WESTBENGAL',
  641005,
  100.23)]

10.Find out the product namewhose starting letter is ‘A’.

In [19]:
cur.execute('SELECT * FROM SELLER WHERE PROD_NAME LIKE "A%"').fetchall()

[('P-6594', 'ACER MONITOR', 5, 20, 100, 24255, 22000),
 ('P-1846', 'APPL MONITOR', 4, 10, 3, 41496, 38000)]

11.Find out the clients name namewhose last letter is ‘M’.

In [20]:
cur.execute('SELECT * FROM BUYER WHERE NAME LIKE "%M"').fetchall()

[('C-1005',
  'BASHEEM',
  'MAHATMA STREET',
  'LANE 2',
  'PUNE',
  'MAHARASTRA',
  641105,
  650.75)]

12.Find out the clients who stay in state Tamil Nadu and city Coimbatore.

In [21]:
cur.execute('SELECT * FROM BUYER WHERE CITY = "COIMBATORE" AND STATE = "TAMIL NADU"').fetchall()

[('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'LANE 1',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45)]

13.List the products in sorted order of their description.

In [22]:
cur.execute('SELECT * FROM SELLER ORDER BY PROD_NAME').fetchall()

[('P-6594', 'ACER MONITOR', 5, 20, 100, 24255, 22000),
 ('P-1846', 'APPL MONITOR', 4, 10, 3, 41496, 38000),
 ('P-7596', 'COMPAQ MONITOR', 5, 10, 3, 7875, 7500),
 ('P-2484', 'DELL MONITOR', 2, 10, 3, 32130, 30000),
 ('P-5864', 'HP MONITOR', 5, 20, 5, 7875, 7500),
 ('P-4569', 'LENO MONITOR', 2.5, 10, 3, 55695.9375, 51750),
 ('P-2564', 'LG MONITOR', 5, 100, 20, 55125, 55000),
 ('P-3598', 'SAM MONITOR', 6, 10, 3, 11872, 11200),
 ('P-3265', 'XIAOMI MONITOR', 5, 2, 3, 7875, 7500)]

14.List the product which is highest in Selling Price

In [23]:
cur.execute('SELECT PRODUCT_ID, PROD_NAME, MAX(SELL_PRICE) FROM SELLER').fetchall()

[('P-4569', 'LENO MONITOR', 55695.9375)]

15.List the Product Information whose Profit Percent is very low.

In [24]:
cur.execute('SELECT PRODUCT_ID, PROD_NAME, MIN(PROFIT_PERCENT) FROM SELLER').fetchall()

[('P-2484', 'DELL MONITOR', 2)]

16.Increase the profit percentage of Appl Monitor to 8%. Update the Selling and Cost Price accordingly.

In [25]:
cur.execute('UPDATE SELLER SET PROFIT_PERCENT = 8, SELL_PRICE = COST_PRICE*1.08 WHERE PROD_NAME = "APPL MONITOR"').fetchall()

[]

17.Calculate the average price of all the products

In [26]:
cur.execute('SELECT AVG(SELL_PRICE), AVG(COST_PRICE) FROM SELLER').fetchall()

[(27082.54861111111, 25605.555555555555)]

18.Calculate the minimum price of products.

In [27]:
cur.execute('SELECT MIN(SELL_PRICE), MIN(COST_PRICE) FROM SELLER').fetchall()

[(7875, 7500)]

19.Determine the maximum and minimum prices.Rename the title as ‘max_price’ and min_price respectively.

In [28]:
cur.execute('SELECT MIN(SELL_PRICE) AS MIN_PRICE, MAX(SELL_PRICE) AS MAX_PRICE FROM SELLER').fetchall()

[(7875, 55695.9375)]

20.Count the number of products having price greater thanor equal to 15000

In [29]:
cur.execute('SELECT COUNT(PRODUCT_ID) FROM SELLER WHERE SELL_PRICE >= 15000').fetchall()

[(5,)]

21.Add a new column phone_no in the client_master tableand update appropriate value to it.

In [30]:
cur.execute('ALTER TABLE BUYER ADD COLUMN PHONE_NO CHAR(10)').fetchall()

[]

In [31]:
cur.execute('SELECT COUNT(CLIENT_ID) FROM BUYER').fetchall()

[(5,)]

In [32]:
cur.execute('SELECT * FROM BUYER').fetchall()

[('C-1003',
  'XAVIER',
  'EINSTEIN STREET',
  'LANE 3',
  'CHENNAI',
  'TAMIL NADU',
  642005,
  2000.25,
  None),
 ('C-1005',
  'BASHEEM',
  'MAHATMA STREET',
  'LANE 2',
  'PUNE',
  'MAHARASTRA',
  641105,
  650.75,
  None),
 ('C-1002',
  'RAJU',
  'ARMSTRONG STREET',
  'LANE 2',
  'MUMBAI',
  'MAHARASTRA',
  641105,
  1000,
  None),
 ('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'LANE 1',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45,
  None),
 ('C-1006',
  'FLASHMA',
  'INDIRA STREET',
  'LANE 3',
  'KOLKATA',
  'WESTBENGAL',
  641005,
  100.23,
  None)]

In [33]:
insertNums = '''
    BEGIN;

    UPDATE BUYER SET PHONE_NO =  "1234567890" WHERE CLIENT_ID = "C-1001";
    UPDATE BUYER SET PHONE_NO =  "1234567892" WHERE CLIENT_ID = "C-1002";
    UPDATE BUYER SET PHONE_NO =  "1234567893" WHERE CLIENT_ID = "C-1006";
    UPDATE BUYER SET PHONE_NO =  "1234567894" WHERE CLIENT_ID = "C-1004";
    UPDATE BUYER SET PHONE_NO =  "1234567891" WHERE CLIENT_ID = "C-1003";

    COMMIT;
    '''

cur.executescript(insertNums)

In [34]:
cur.execute('SELECT * FROM BUYER').fetchall()

[('C-1003',
  'XAVIER',
  'EINSTEIN STREET',
  'LANE 3',
  'CHENNAI',
  'TAMIL NADU',
  642005,
  2000.25,
  '1234567891'),
 ('C-1005',
  'BASHEEM',
  'MAHATMA STREET',
  'LANE 2',
  'PUNE',
  'MAHARASTRA',
  641105,
  650.75,
  None),
 ('C-1002',
  'RAJU',
  'ARMSTRONG STREET',
  'LANE 2',
  'MUMBAI',
  'MAHARASTRA',
  641105,
  1000,
  '1234567892'),
 ('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'LANE 1',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45,
  '1234567894'),
 ('C-1006',
  'FLASHMA',
  'INDIRA STREET',
  'LANE 3',
  'KOLKATA',
  'WESTBENGAL',
  641005,
  100.23,
  '1234567893')]

22.Renamethe table Buyeras Client.

In [35]:
cur.execute('ALTER TABLE BUYER RENAME TO CLIENT').fetchall()

[]

In [36]:
cur.execute('SELECT * FROM CLIENT').fetchall()

[('C-1003',
  'XAVIER',
  'EINSTEIN STREET',
  'LANE 3',
  'CHENNAI',
  'TAMIL NADU',
  642005,
  2000.25,
  '1234567891'),
 ('C-1005',
  'BASHEEM',
  'MAHATMA STREET',
  'LANE 2',
  'PUNE',
  'MAHARASTRA',
  641105,
  650.75,
  None),
 ('C-1002',
  'RAJU',
  'ARMSTRONG STREET',
  'LANE 2',
  'MUMBAI',
  'MAHARASTRA',
  641105,
  1000,
  '1234567892'),
 ('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'LANE 1',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45,
  '1234567894'),
 ('C-1006',
  'FLASHMA',
  'INDIRA STREET',
  'LANE 3',
  'KOLKATA',
  'WESTBENGAL',
  641005,
  100.23,
  '1234567893')]

23.Remove the Column adddress2 from Buyer(Client) table and modify address1 limit to varchar(255)

In [37]:
cur.execute('ALTER TABLE CLIENT DROP COLUMN ADDRESS2').fetchall()

# Modify statement is not supported in SQLite. The ADDRESS1 column will be able to handle large text even though explicit size has been specified earlier.

[]

24.Write a SQL statement to rename the columnname address1 to address.

In [38]:
cur.execute('ALTER TABLE CLIENT RENAME COLUMN ADDRESS1 TO ADDRESS').fetchall()

[]

25.Add a new column ‘Type of Usage’(Commercial / Domestic) to the table Buyer(Client)and add appropriate values to it.

In [39]:
cur.execute('ALTER TABLE CLIENT ADD COLUMN USE_Type VARCHAR(10)').fetchall()

[]

In [40]:
insertTypes = '''
    BEGIN;

    UPDATE CLIENT SET USE_TYPE = "COMMERCIAL" WHERE CLIENT_ID = "C-1001";
    UPDATE CLIENT SET USE_TYPE = "DOMESTIC" WHERE CLIENT_ID = "C-1002";
    UPDATE CLIENT SET USE_TYPE = "DOMESTIC" WHERE CLIENT_ID = "C-1006";
    UPDATE CLIENT SET USE_TYPE = "COMMERCIAL" WHERE CLIENT_ID = "C-1003";
    UPDATE CLIENT SET USE_TYPE = "DOMESTIC" WHERE CLIENT_ID = "C-1004";

    COMMIT;
    '''

cur.executescript(insertTypes)

In [41]:
cur.execute('SELECT * FROM CLIENT').fetchall()

[('C-1003',
  'XAVIER',
  'EINSTEIN STREET',
  'CHENNAI',
  'TAMIL NADU',
  642005,
  2000.25,
  '1234567891',
  'COMMERCIAL'),
 ('C-1005',
  'BASHEEM',
  'MAHATMA STREET',
  'PUNE',
  'MAHARASTRA',
  641105,
  650.75,
  None,
  None),
 ('C-1002',
  'RAJU',
  'ARMSTRONG STREET',
  'MUMBAI',
  'MAHARASTRA',
  641105,
  1000,
  '1234567892',
  'DOMESTIC'),
 ('C-1004',
  'PAANDU',
  'COLUMBUS STREET',
  'COIMBATORE',
  'TAMIL NADU',
  641005,
  1500.45,
  '1234567894',
  'DOMESTIC'),
 ('C-1006',
  'FLASHMA',
  'INDIRA STREET',
  'KOLKATA',
  'WESTBENGAL',
  641005,
  100.23,
  '1234567893',
  'DOMESTIC')]

In [42]:
conn.commit()
conn.close()